stuianna/globLib/STM32F103CB/lib/stm32f103cb_timer.c
            nvic_disable_irq(NVIC_TIM4_IRQ);
            timer_disable_irq(TIM4,TIM_DIER_UIE);
            break;
        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;

}

void tim1_cc_isr(void){

    tim1_cc_handler();
    timer_clear_flag(TIM1,TIM_SR_UIF);
} 

void tim1_up_isr(void){

    tim1_up_handler();
    timer_clear_flag(TIM1,TIM_SR_UIF);
}

void tim2_isr(void){

    t2_stat_reg = TIM_SR(TIM2) & TIM_SR_UIF;
    timer_clear_flag(TIM2,TIM_SR_UIF);
    tim2_up_handler();
}

void tim3_isr(void){

    timer_clear_flag(TIM3,TIM_SR_UIF);
    tim3_up_handler();
}

void tim4_isr(void){

    timer_clear_flag(TIM4,TIM_SR_UIF);
    tim4_up_handler();
}
/****************************************************************************/
//			                PAUSE RESUME
/****************************************************************************/

mcu_error TIMER_pause(timer_main timerNumber){

    mcu_error error = E_TIMER_NOERROR;

    switch(timerNumber){

        case TIMER_1:

            timer_disable_counter(TIM1);
            break;
        case TIMER_2:
            
            timer_disable_counter(TIM2);
            break;
        case TIMER_3:

            timer_disable_counter(TIM3);
            break;
        case TIMER_4:

            timer_disable_counter(TIM4);
            break;
        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;
}

mcu_error TIMER_resume(timer_main timerNumber){

    mcu_error error = E_TIMER_NOERROR;

    switch(timerNumber){

        case TIMER_1:

            timer_enable_counter(TIM1);
            break;
        case TIMER_2:
            
            timer_enable_counter(TIM2);
            break;
        case TIMER_3:

            timer_enable_counter(TIM3);
            break;
        case TIMER_4:

            timer_enable_counter(TIM4);
            break;
        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;
}

/****************************************************************************/
//			                SETUP FUNCTIONS
/****************************************************************************/

mcu_error TIMER_setupIC(timer_main timerNumber, timer_channel timerChannel){

    mcu_error error = E_TIMER_NOERROR;

    switch(timerNumber){

        case TIMER_1:

                error = timer1_setupIC(timerChannel);
            break;
        case TIMER_2:

                error = timer2_setupIC(timerChannel);
                TIMER_enableISR(TIMER_2,&timer2_input_capture);
            break;
        case TIMER_3:

                error = timer3_setupIC(timerChannel);
                TIMER_enableISR(TIMER_3,&timer3_input_capture);
            break;
        case TIMER_4:

                error = timer4_setupIC(timerChannel);
                TIMER_enableISR(TIMER_4,&timer4_input_capture);
                break;
        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;
}

mcu_error TIMER_setupPWM(timer_main timerNumber, timer_channel timerChannel, uint32_t frequency, uint8_t duty){

    mcu_error error = E_TIMER_NOERROR;

    switch(timerNumber){

        case TIMER_1:

                error = timer1_setupPWM(timerChannel,frequency,duty);
            break;
        case TIMER_2:

                error = timer2_setupPWM(timerChannel,frequency,duty);
            break;
        case TIMER_3:

                error = timer3_setupPWM(timerChannel,frequency,duty);
            break;
        case TIMER_4:

                error = timer4_setupPWM(timerChannel,frequency,duty);
                break;
        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;
}
mcu_error TIMER_setupPulse(timer_main timerNumber, timer_channel timerChannel, uint32_t frequency, uint32_t pulse){

    mcu_error error = E_TIMER_NOERROR;

    switch(timerNumber){

        case TIMER_1:

                error = timer1_setupPulse(timerChannel,frequency,pulse);
            break;
        case TIMER_2:

                error = timer2_setupPulse(timerChannel,frequency,pulse);
            break;
        case TIMER_3:

                error = timer3_setupPulse(timerChannel,frequency,pulse);
            break;
        case TIMER_4:

                error = timer4_setupPulse(timerChannel,frequency,pulse);
                break;
        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;
}

mcu_error TIMER_setupCount(timer_main timerNumber, uint32_t frequency, void (*handler)(void)){

    mcu_error error = E_TIMER_NOERROR;

    switch(timerNumber){

        case TIMER_1:

            //Set the clock
            rcc_periph_clock_enable(RCC_TIM1);

            //Setup main timer
            timer_disable_counter(TIM1);
            timer_reset(TIM1);
            timer_set_mode(TIM1, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_UP);
            TIMER_setFrequency(TIMER_1,frequency);

            TIMER_enableISR(timerNumber,handler);

            timer_enable_counter(TIM1);

            break;
        case TIMER_2:

            //Set the clock
            rcc_periph_clock_enable(RCC_TIM2);

            //Setup main timer
            timer_disable_counter(TIM2);
            timer_reset(TIM2);
            timer_set_mode(TIM2, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_UP);
            TIMER_setFrequency(timerNumber ,frequency);

            TIMER_enableISR(timerNumber,handler);

            timer_enable_counter(TIM2);

            break;
        case TIMER_3:

