stuianna/globLib/STM32F103CB/lib/stm32f103cb_timer.c
                case CHANNEL_4:

                        return t4c4_cap;
                        break;
            }
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            return E_TIMER_NOTIMER;

            break;
    }

    return E_TIMER_NOERROR;


}

mcu_error timer1_setupPWM(timer_channel timerChannel, uint32_t frequency, uint8_t duty){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM1);

    //Setup main timer
    timer_disable_counter(TIM1);
    timer_set_mode(TIM1, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_DOWN);
    timer_enable_break_main_output(TIM1);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_PWM,PORTA,PIN8);

            timer_set_oc_mode(TIM1, TIM_OC1, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM1, TIM_OC1);
            TIMER_setPeriod(TIMER_1,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_1,CHANNEL_1,duty);
            timer_enable_counter(TIM1);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_PWM,PORTA,PIN9);

            timer_set_oc_mode(TIM1, TIM_OC2, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM1, TIM_OC2);
            TIMER_setPeriod(TIMER_1,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_1,CHANNEL_2,duty);
            timer_enable_counter(TIM1);
            break;
        case CHANNEL_3:

            pinSetup(GPIO_PWM,PORTA,PIN10);

            timer_set_oc_mode(TIM1, TIM_OC3, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM1, TIM_OC3);
            TIMER_setPeriod(TIMER_1,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_1,CHANNEL_3,duty);
            timer_enable_counter(TIM1);
            break;
        case CHANNEL_4:

            pinSetup(GPIO_PWM,PORTA,PIN11);

            timer_set_oc_mode(TIM1, TIM_OC4, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM1, TIM_OC4);
            TIMER_setPeriod(TIMER_1,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_1,CHANNEL_4,duty);
            timer_enable_counter(TIM1);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;

}


mcu_error timer2_setupPWM(timer_channel timerChannel, uint32_t frequency, uint8_t duty){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM2);

    //Setup main timer
    timer_disable_counter(TIM2);
    timer_set_mode(TIM2, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_DOWN);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_PWM,PORTA,PIN0);

            timer_set_oc_mode(TIM2, TIM_OC1, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM2, TIM_OC1);
            TIMER_setPeriod(TIMER_2,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_2,CHANNEL_1,duty);
            timer_enable_counter(TIM2);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_PWM,PORTA,PIN1);

            timer_set_oc_mode(TIM2, TIM_OC2, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM2, TIM_OC2);
            TIMER_setPeriod(TIMER_2,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_2,CHANNEL_2,duty);
            timer_enable_counter(TIM2);
            break;
            
        case CHANNEL_3:

            pinSetup(GPIO_PWM,PORTA,PIN2);

            timer_set_oc_mode(TIM2, TIM_OC3, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM2, TIM_OC3);
            TIMER_setPeriod(TIMER_2,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_2,CHANNEL_3,duty);
            timer_enable_counter(TIM2);
            break;
        case CHANNEL_4:

            pinSetup(GPIO_PWM,PORTA,PIN3);

            timer_set_oc_mode(TIM2, TIM_OC4, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM2, TIM_OC4);
            TIMER_setPeriod(TIMER_2,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_2,CHANNEL_4,duty);
            timer_enable_counter(TIM2);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;
}

mcu_error timer3_setupPWM(timer_channel timerChannel, uint32_t frequency, uint8_t duty){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM3);

    //Setup main timer
    timer_disable_counter(TIM3);
    timer_set_mode(TIM3, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_DOWN);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_PWM,PORTA,PIN6);

            timer_set_oc_mode(TIM3, TIM_OC1, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM3, TIM_OC1);
            TIMER_setPeriod(TIMER_3,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_3,CHANNEL_1,duty);
            timer_enable_counter(TIM3);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_PWM,PORTA,PIN7);

            timer_set_oc_mode(TIM3, TIM_OC2, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM3, TIM_OC2);
            TIMER_setPeriod(TIMER_3,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_3,CHANNEL_2,duty);
            timer_enable_counter(TIM3);
            break;
            
        case CHANNEL_3:

            pinSetup(GPIO_PWM,PORTB,PIN0);

            timer_set_oc_mode(TIM3, TIM_OC3, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM3, TIM_OC3);
            TIMER_setPeriod(TIMER_3,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_3,CHANNEL_3,duty);
            timer_enable_counter(TIM3);
            break;

        case CHANNEL_4:

            pinSetup(GPIO_PWM,PORTB,PIN1);

            timer_set_oc_mode(TIM3, TIM_OC4, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM3, TIM_OC4);
            TIMER_setPeriod(TIMER_3,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_3,CHANNEL_4,duty);
            timer_enable_counter(TIM3);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;

