stuianna/globLib/STM32F103CB/lib/stm32f103cb_timer.c
                        }
                            
                        break;

                case CHANNEL_2:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM2) &= ~TIM_CCER_CC2E;
                        }
                        else{
                            TIM_CCER(TIM2) |= TIM_CCER_CC2E;
                            timer_set_oc_value(TIM2, TIM_OC2, TIM_ARR(TIM2)*((float)(duty)/100.0f));

                        }
                        break;

                case CHANNEL_3:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM2) &= ~TIM_CCER_CC3E;
                        }
                        else{
                            TIM_CCER(TIM2) |= TIM_CCER_CC3E;
                            timer_set_oc_value(TIM2, TIM_OC3, TIM_ARR(TIM2)*((float)(duty)/100.0f));

                        }
                        break;
                      
                case CHANNEL_4:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM2) &= ~TIM_CCER_CC4E;
                        }
                        else{
                            TIM_CCER(TIM2) |= TIM_CCER_CC4E;
                            timer_set_oc_value(TIM2, TIM_OC4, TIM_ARR(TIM2)*((float)(duty)/100.0f));

                        }
                        break;
            }
            break;
        case TIMER_3:

            switch(channel){

                case CHANNEL_1:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM3) &= ~TIM_CCER_CC1E;
                        }
                        else{
                            TIM_CCER(TIM3) |= TIM_CCER_CC1E;
                            timer_set_oc_value(TIM3, TIM_OC1, TIM_ARR(TIM3)*((float)(duty)/100.0f));

                        }
                            
                        break;

                case CHANNEL_2:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM3) &= ~TIM_CCER_CC2E;
                        }
                        else{
                            TIM_CCER(TIM3) |= TIM_CCER_CC2E;
                            timer_set_oc_value(TIM3, TIM_OC2, TIM_ARR(TIM3)*((float)(duty)/100.0f));

                        }
                        break;

                case CHANNEL_3:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM3) &= ~TIM_CCER_CC3E;
                        }
                        else{
                            TIM_CCER(TIM3) |= TIM_CCER_CC3E;
                            timer_set_oc_value(TIM3, TIM_OC3, TIM_ARR(TIM3)*((float)(duty)/100.0f));

                        }
                        break;
                      
                case CHANNEL_4:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM3) &= ~TIM_CCER_CC4E;
                        }
                        else{
                            TIM_CCER(TIM3) |= TIM_CCER_CC4E;
                            timer_set_oc_value(TIM3, TIM_OC4, TIM_ARR(TIM3)*((float)(duty)/100.0f));

                        }
                        break;
            }
            break;
        case TIMER_4:

            switch(channel){

                case CHANNEL_1:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM4) &= ~TIM_CCER_CC1E;
                        }
                        else{
                            TIM_CCER(TIM4) |= TIM_CCER_CC1E;
                            timer_set_oc_value(TIM4, TIM_OC1, TIM_ARR(TIM4)*((float)(duty)/100.0f));

                        }
                            
                        break;

                case CHANNEL_2:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM4) &= ~TIM_CCER_CC2E;
                        }
                        else{
                            TIM_CCER(TIM4) |= TIM_CCER_CC2E;
                            timer_set_oc_value(TIM4, TIM_OC2, TIM_ARR(TIM4)*((float)(duty)/100.0f));

                        }
                        break;

                case CHANNEL_3:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM4) &= ~TIM_CCER_CC3E;
                        }
                        else{
                            TIM_CCER(TIM4) |= TIM_CCER_CC3E;
                            timer_set_oc_value(TIM4, TIM_OC3, TIM_ARR(TIM4)*((float)(duty)/100.0f));

                        }
                        break;
                      
                case CHANNEL_4:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM4) &= ~TIM_CCER_CC4E;
                        }
                        else{
                            TIM_CCER(TIM4) |= TIM_CCER_CC4E;
                            timer_set_oc_value(TIM4, TIM_OC4, TIM_ARR(TIM4)*((float)(duty)/100.0f));

                        }
                        break;
            }
                break;
        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            return E_TIMER_NOTIMER;

            break;
    }

    return E_TIMER_NOERROR;

}
mcu_error TIMER_setPulse(timer_main timerNumber, timer_channel channel,  uint32_t pulse){

