stuianna/globLib/STM32F103CB/lib/stm32f103cb_timer.c
    mcu_error error = E_TIMER_NOERROR;

    switch(timerNumber){

        case TIMER_1:

            switch(channel){

                case CHANNEL_1:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM1) &= ~TIM_CCER_CC1E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM1)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM1);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM1) |= TIM_CCER_CC1E;
                            timer_set_oc_value(TIM1, TIM_OC1, pulse-1);
                        }

                        break;

                case CHANNEL_2:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM1) &= ~TIM_CCER_CC2E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM1)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM1);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM1) |= TIM_CCER_CC2E;
                            timer_set_oc_value(TIM1, TIM_OC2, pulse-1);
                        }
                        break;

                case CHANNEL_3:
                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM1) &= ~TIM_CCER_CC3E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM1)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM1);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM1) |= TIM_CCER_CC3E;
                            timer_set_oc_value(TIM1, TIM_OC3, pulse-1);
                        }
                        break;
                      
                case CHANNEL_4:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM1) &= ~TIM_CCER_CC4E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM1)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM1);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM1) |= TIM_CCER_CC4E;
                            timer_set_oc_value(TIM1, TIM_OC4, pulse-1);
                        }
                        break;
            }

            break;
        case TIMER_2:

            switch(channel){

                case CHANNEL_1:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM2) &= ~TIM_CCER_CC1E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM2)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM2);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM2) |= TIM_CCER_CC1E;
                            timer_set_oc_value(TIM2, TIM_OC1, pulse-1);
                        }

                        break;

                case CHANNEL_2:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM2) &= ~TIM_CCER_CC2E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM2)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM2);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM2) |= TIM_CCER_CC2E;
                            timer_set_oc_value(TIM2, TIM_OC2, pulse-1);
                        }
                        break;

                case CHANNEL_3:
                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM2) &= ~TIM_CCER_CC3E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM2)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM2);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
