stuianna/globLib/STM32F103CB/lib/stm32f103cb_timer.c
                            }
                            TIM_CCER(TIM4) |= TIM_CCER_CC2E;
                            timer_set_oc_value(TIM4, TIM_OC2, pulse-1);
                        }
                        break;

                case CHANNEL_3:
                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM4) &= ~TIM_CCER_CC3E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM4)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM4);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM4) |= TIM_CCER_CC3E;
                            timer_set_oc_value(TIM4, TIM_OC3, pulse-1);
                        }
                        break;
                      
                case CHANNEL_4:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM4) &= ~TIM_CCER_CC4E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM4)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM4);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM4) |= TIM_CCER_CC4E;
                            timer_set_oc_value(TIM4, TIM_OC4, pulse-1);
                        }
                        break;
            }

                break;
        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;

}



